# GetCableBreaksCnt

## Description
Get the count of cable breaks in the cable.

```pascal
FUNCTION GetCableBreaksCnt(hObj : HANDLE) : INTEGER;
```

```python

def vs.GetCableBreaksCnt(hObj):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Examples
```pascal
resultN := GetCableBreaksCnt(hObj);
```
```python
import vs

# Get the count of cable breaks in the cable.
hObj = vs.FSActLayer()  # handle to the first selected object on the active layer

resultN = vs.GetCableBreaksCnt(hObj)
vs.Message('GetCableBreaksCnt returned: ' + str(resultN))
```

## Version
Availability: from Vectorworks 2025.4

## Category
* Objects - Cables